{
  "_name_or_path": "allenai/scibert_scivocab_uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-AUTHOR",
    "2": "I-AUTHOR",
    "3": "B-TITLE",
    "4": "I-TITLE",
    "5": "B-JOURNAL",
    "6": "I-JOURNAL",
    "7": "B-YEAR",
    "8": "I-YEAR",
    "9": "B-VOLUME",
    "10": "I-VOLUME",
    "11": "B-ISSUE",
    "12": "I-ISSUE",
    "13": "B-PAGES",
    "14": "I-PAGES",
    "15": "B-DOI",
    "16": "I-DOI"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AUTHOR": 1,
    "B-DOI": 15,
    "B-ISSUE": 11,
    "B-JOURNAL": 5,
    "B-PAGES": 13,
    "B-TITLE": 3,
    "B-VOLUME": 9,
    "B-YEAR": 7,
    "I-AUTHOR": 2,
    "I-DOI": 16,
    "I-ISSUE": 12,
    "I-JOURNAL": 6,
    "I-PAGES": 14,
    "I-TITLE": 4,
    "I-VOLUME": 10,
    "I-YEAR": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
